[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:49:9
             Header: 'Explanation',
             accessor: 'explanation',
         },
-        {
-            Header: 'Date',
-            accessor: 'dateAdded',
-        }
+        {}
     ];
 
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:50:21
             accessor: 'explanation',
         },
         {
-            Header: 'Date',
+            Header: "",
             accessor: 'dateAdded',
         }
killedBy: ArticlesTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
