[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:19:26
 
     const navigate = useNavigate();
 
-    const testIdPrefix = "ArticlesForm";
+    const testIdPrefix = "";
 
     // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: ArticlesForm tests renders correctly when passing in an Article
statusReason: Error: Unable to find an element by: [data-testid="/ArticlesForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:99:43
                     id="email"
                     type="text"
                     isInvalid={Boolean(errors.email)}
-                    {...register("email", {
-                        required: "Email is required."
-                    })}
+                    {...register("email", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:115:51
                         id="dateAdded"
                         type="date"
                         isInvalid={Boolean(errors.dateAdded)}
-                        {...register("dateAdded", { required: true, pattern: isodate_regex })}
+                        {...register("dateAdded", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateAdded is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
