[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:43:72
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: true, pattern: email_regex })}
+                            {...register("requesterEmail", { required: false, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:43:60
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: true, pattern: email_regex })}
+                            {...register("requesterEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Requester email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:46:30
                             {...register("requesterEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester email is required.'}
+                            {true}
                             {errors.requesterEmail?.type === 'pattern' && 'Requester email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:46:30
                             {...register("requesterEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester email is required.'}
+                            {errors.requesterEmail || 'Requester email is required.'}
                             {errors.requesterEmail?.type === 'pattern' && 'Requester email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:47:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester email is required.'}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester email must be a valid email.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Requester email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:47:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester email is required.'}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester email must be a valid email.'}
+                            {errors.requesterEmail.type === 'pattern' && 'Requester email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:66:72
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true, pattern: email_regex })}
+                            {...register("professorEmail", { required: false, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:66:60
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true, pattern: email_regex })}
+                            {...register("professorEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:69:30
                             {...register("professorEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor email is required.'}
+                            {errors.professorEmail || 'Professor email is required.'}
                             {errors.professorEmail?.type === 'pattern' && 'Professor email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:69:30
                             {...register("professorEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor email is required.'}
+                            {true}
                             {errors.professorEmail?.type === 'pattern' && 'Professor email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:70:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor email is required.'}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor email must be a valid email.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:70:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor email is required.'}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor email must be a valid email.'}
+                            {true && 'Professor email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Professor email must be a valid email.</div> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:102:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="RecommendationRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:102:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="RecommendationRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:126:71
                             id="dateRequested"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateRequested)}
-                            {...register("dateRequested", { required: true, pattern: isodate_regex })}
+                            {...register("dateRequested", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date requested must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:129:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'Date requested must be in ISO format.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date requested must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:129:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'Date requested must be in ISO format.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date requested must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:142:68
                             id="dateNeeded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("dateNeeded", { required: true, pattern: isodate_regex })}
+                            {...register("dateNeeded", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:142:56
                             id="dateNeeded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("dateNeeded", { required: true, pattern: isodate_regex })}
+                            {...register("dateNeeded", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:145:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'Date needed must be in ISO format.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:145:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'Date needed must be in ISO format.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
